{
    "posts":[
      {
        "id": "1",
        "title": "Probate Administration: Navigating the Legal Landscape",
        "href": "/posts/probate-administration",
        "description":
          "Navigating the probate process can be emotionally and legally complex, especially after the loss of a loved one. In this article, we break down the key stages of probate administration in Kenya, including obtaining a grant of probate or letters of administration, handling estate assets, settling debts, and distributing inheritance. Whether you're an executor, administrator, or beneficiary, this guide will help you understand your rights, responsibilities, and the legal framework involved. Learn how to avoid common pitfalls and ensure a smooth, compliant administration of the deceased’s estate.",
        "date": "Mar 16, 2025",
        "datetime": "2020-03-16",
        "category": { "id":"1" },
        "author": {
          "id": "1"
        }
      },
      {
        "id": "2",
        "title": "Understanding Wills and Testaments in Kenya",
        "href": "/posts/understanding-wills-and-testaments",
        "description":
          "A will is a legal document that outlines how a person's assets should be distributed after their death. In Kenya, the law recognizes both written and oral wills, but written wills are more common and easier to enforce. This article explains the requirements for creating a valid will in Kenya, including the need for witnesses, the importance of clear language, and the role of executors. It also discusses how to revoke or amend a will and the implications of dying without a will (intestate).",
        "date": "Mar 17, 2025",
        "datetime": "2020-03-17",
        "category": { 
          "id": "2" 
        },
        "author": {
          "id":"1"
        }
      },
      {
        "id": "3",
        "title": "The Role of Executors in Estate Administration",
        "href": "/posts/the-role-of-executors-in-estate-administration",
        "description":
          "Executors play a crucial role in managing and distributing a deceased person's estate. This article outlines the responsibilities of executors in Kenya, including applying for a grant of probate, collecting and managing estate assets, paying debts and taxes, and distributing the remaining assets to beneficiaries. It also covers the legal requirements for being appointed as an executor, the importance of transparency and communication with beneficiaries, and the potential challenges executors may face, such as disputes among beneficiaries or claims against the estate.",
        "date": "Mar 18, 2025",
        "datetime": "2020-03-18",
        "category": { 
          "id": "2" 
        },
        "author": {
          "id": "1"
        }
      }
    ],
    "categories":[
      {
        "id": "1",
        "title": "Administration",
        "href": "/categories/probate-administration",
        "description": "Legal processes involved in managing a deceased person's estate."
      },
      {
        "id": "2",
        "title": "Wills",
        "href": "/categories/wills",
        "description": "Legal documents outlining the distribution of assets after death."
      },
      {
        "id": "3",
        "title": "Executors",
        "href": "/categories/executors",
        "description": "Individuals responsible for administering a deceased person's estate."
      }
    ],
    "users":[
      {
        "id": "1",
        "name": "Advocate Eva Nduta Munene",
        "email": "eva@enmlegal.com",
        "role": "Managing Partner",
        "imageUrl": "/profile.png"
      }
    ]
}